
&НаКлиенте
Процедура Запустить(Команда)
	ПараметрыФормы = Новый Структура;
 
	ОткрытьФорму("ВнешняяОбработка.ОчисткаБазы.Форма.ФормаВыбораМетаданных", ПараметрыФормы);

КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервере()
		 
		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыборОбъектовМетаданных" Тогда
		МассивОбъектов = Новый Массив;
		Для Каждого стр из Параметр Цикл
			МассивОбъектов.Добавить(стр.Значение);
		КонецЦикла;
		ОбработатьСтруктуруНаСервере(МассивОбъектов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтруктуруНаСервере(МассивОбъектов)
	
	СтруктураОбъектов = ПолучитьСтруктуруХраненияБазыДанных(МассивОбъектов);
	
	ТекстРезультат = "USE erp_dev;" + Символы.ПС + "GO" + Символы.ПС;
	для каждого стр из СтруктураОбъектов Цикл
		ТекстРезультат = ТекстРезультат + "IF OBJECT_ID (N'_" + СтрЗаменить(стр.ИмяТаблицыХранения, ".", "_") + "', N'U') IS NOT NULL" + Символы.ПС;
		ТекстРезультат = ТекстРезультат + Символы.Таб + "TRUNCATE TABLE _" + СтрЗаменить(стр.ИмяТаблицыХранения, ".", "_") + ";" + Символы.ПС + "GO" + Символы.ПС;
		ТекстРезультат = ТекстРезультат + "IF OBJECT_ID (N'_" + СтрЗаменить(стр.ИмяТаблицыХранения, ".", "_") + "X1', N'U') IS NOT NULL" + Символы.ПС;
		ТекстРезультат = ТекстРезультат + Символы.Таб + "TRUNCATE TABLE _" + СтрЗаменить(стр.ИмяТаблицыХранения, ".", "_") + "X1;" + Символы.ПС + "GO" + Символы.ПС;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Функция ПолучитьПолноеИмяФормы1(ИмяФормы)

   Возврат Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + ИмяФормы;//


КонецФункции

